## 5.4. Ejercicios:
Haz las importaciones necesarias para establecer la conexión y trabajar con Pandas. Establece la conexión usando mysql.connector utilizando try/except por si la conexión devuelve un error.

In [5]:
import mysql.connector
from mysql.connector import errorcode
import pandas as pd
import numpy as np

2. Crea un nuevo "schema" llamado "alumnas-promo-X"

In [7]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


mi_cursor = cnx.cursor()
try:
    mi_cursor.execute("CREATE DATABASE alumnas_promo_h_da")
    print(mi_cursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE DATABASE alumnas_promo_h_da

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [9]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_h_da')


mi_cursor = cnx.cursor()
try:
    mi_cursor.execute("CREATE TABLE alumnas (id_alumna INTEGER AUTO_INCREMENT PRIMARY KEY, nombre VARCHAR(15), apellidos VARCHAR(50), ciudad VARCHAR(30), telefono VARCHAR(15))")
    print(mi_cursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE TABLE alumnas (id_alumna INTEGER ..

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [16]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_h_da')


mi_cursor = cnx.cursor()
query = "INSERT INTO alumnas (nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s)"
val = [('Ana', 'García López', 'Madrid', '612345678'),
('Beatriz', 'Fernández Vargas', 'Barcelona', '656789012'),
('Clara', 'Martínez Ruiz', 'Valencia', '678901234'),
('Diana', 'Jiménez Alonso', 'Sevilla', '690123456'),
('Elena', 'Moreno Molina', 'Zaragoza', '612345687'),
('Fátima', 'Pérez García', 'Málaga', '623456789'),
('Gloria', 'Sánchez Hernández', 'Murcia', '634567891'),
('Helena', 'Díaz Martín', 'Palma', '645678902'),
('Irene', 'López Castillo', 'Las Palmas', '656789013'),
('Julia', 'Torres Romero', 'Bilbao', '667890124')]
try: 
    mi_cursor.executemany(query, val)
    cnx.commit()
    print(mi_cursor.rowcount, "registro insertado.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

10 registro insertado.

Aqui he borrado un registro insertado por error. Habia usado 'execute()' en véz de 'executemany()' en el bloque anterior. Asi que he borrado y vuelvo a insertar registros.

In [15]:
# cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
#                               host='127.0.0.1', database='alumnas_promo_h_da')


# mi_cursor = cnx.cursor()
# sql = "DELETE FROM alumnas WHERE nombre= 'Ana' AND apellidos='García López' AND ciudad = 'Madrid' AND telefono = '612345678'"
# try:
#     mi_cursor.execute(sql)
#     cnx.commit()
#     print(mi_cursor.rowcount, "registro/s eliminado/s")

# except mysql.connector.Error as err:
#     print(err)
#     print("Error Code:", err.errno)
#     print("SQLSTATE", err.sqlstate)
#     print("Message", err.msg)

1 registro/s eliminado/s

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [20]:
cnx = mysql.connector.connect(
              user='root', password='AlumnaAdalab',
              host='127.0.0.1',
              database='alumnas_promo_h_da'
)

mi_cursor = cnx.cursor()
mi_cursor.execute("SELECT * FROM alumnas")

resultado = mi_cursor.fetchall()
print(resultado)

df_alumnas= pd.DataFrame(resultado, columns = ['ID_alumna', 'Nombre', 'Apellido','Ciudad','Telefono'])
cnx.close()

[(2, 'Ana', 'García López', 'Madrid', '612345678'), (3, 'Beatriz', 'Fernández Vargas', 'Barcelona', '656789012'), (4, 'Clara', 'Martínez Ruiz', 'Valencia', '678901234'), (5, 'Diana', 'Jiménez Alonso', 'Sevilla', '690123456'), (6, 'Elena', 'Moreno Molina', 'Zaragoza', '612345687'), (7, 'Fátima', 'Pérez García', 'Málaga', '623456789'), (8, 'Gloria', 'Sánchez Hernández', 'Murcia', '634567891'), (9, 'Helena', 'Díaz Martín', 'Palma', '645678902'), (10, 'Irene', 'López Castillo', 'Las Palmas', '656789013'), (11, 'Julia', 'Torres Romero', 'Bilbao', '667890124')]

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [21]:
df_alumnas.head(3)

   ID_alumna   Nombre          Apellido     Ciudad   Telefono
0          2      Ana      García López     Madrid  612345678
1          3  Beatriz  Fernández Vargas  Barcelona  656789012
2          4    Clara     Martínez Ruiz   Valencia  678901234

In [22]:
df_alumnas.tail(3)

   ID_alumna  Nombre        Apellido      Ciudad   Telefono
7          9  Helena     Díaz Martín       Palma  645678902
8         10   Irene  López Castillo  Las Palmas  656789013
9         11   Julia   Torres Romero      Bilbao  667890124

7. ¿Hay registros duplicados?

In [23]:
df_alumnas.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [26]:
cnx = mysql.connector.connect(
              user='root', password='AlumnaAdalab',
              host='127.0.0.1',
              database='alumnas_promo_h_da'
)

mi_cursor = cnx.cursor()
mi_cursor.execute("SELECT Ciudad FROM alumnas")

resultado_murcia= mi_cursor.fetchall()
print(resultado_murcia)
cnx.close()

[('Madrid',), ('Barcelona',), ('Valencia',), ('Sevilla',), ('Zaragoza',), ('Málaga',), ('Murcia',), ('Palma',), ('Las Palmas',), ('Bilbao',)]

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [28]:
cnx = mysql.connector.connect(
              user='root', password='AlumnaAdalab',
              host='127.0.0.1',
              database='alumnas_promo_h_da'
)

mi_cursor = cnx.cursor()
mi_cursor.execute("SELECT * FROM alumnas WHERE Ciudad = 'Madrid'")

resultado_murcia= mi_cursor.fetchall()
print(resultado_murcia)
df_alumna_madrid= pd.DataFrame(resultado_murcia, columns = ['ID_alumna', 'Nombre', 'Apellido','Ciudad','Telefono'])
cnx.close()

[(2, 'Ana', 'García López', 'Madrid', '612345678')]

In [29]:
df_alumna_madrid

   ID_alumna Nombre      Apellido  Ciudad   Telefono
0          2    Ana  García López  Madrid  612345678

In [31]:
cnx = mysql.connector.connect(
              user='root', password='AlumnaAdalab',
              host='127.0.0.1',
              database='alumnas_promo_h_da'
)

mi_cursor = cnx.cursor()
mi_cursor.execute("SELECT * FROM alumnas WHERE Ciudad = 'Murcia'")

resultado_murcia= mi_cursor.fetchall()
print(resultado_murcia)
df_alumna_murcia= pd.DataFrame(resultado_murcia, columns = ['ID_alumna', 'Nombre', 'Apellido','Ciudad','Telefono'])
cnx.close()

[(8, 'Gloria', 'Sánchez Hernández', 'Murcia', '634567891')]

In [32]:
df_alumna_murcia

   ID_alumna  Nombre           Apellido  Ciudad   Telefono
0          8  Gloria  Sánchez Hernández  Murcia  634567891